import styles from "./About.module.css";
const About = () => {
  return (
    <div id={styles.aboutBox}>
      <h2 className="title">درباره ما</h2>
      <h3>ما سیستم ها و خدمات دوربین مدار بسته با کیفیت را ارائه می دهیم.</h3>
      <h4 className="title">
        این شرکت در طول فعالیت خود توانسته به طیف وسیعی از مشتریان به خصوص
        ادارات دولتی و سازمان های خصوصی خدمات مناسبی ارائه دهد و به لطف خدا و
        تلاش و کوشش پرسنل خود توانسته رضایت مشتریان را به طور شایسته جلب نماید
      </h4>
      <p>
        نیازهای روز افزون کشور به الکترونیک، فناوری اطلاعات و ارتباطات و همچنین
        توسعه همه جانبه آن در سالهای اخیر و سیاست دولت جمهوری اسلامی ایران مبنی
        بر واگذاری کار به بخش خصوصی، ما را بر آن داشت تا با استفاده از پرسنل
        متخصص، مجرب و امکانات فنی مناسب تحت نام شرکت سینا ارتباط فعالیت خود را
        در امور مخابرات و الکترونیک آغاز نماییم تا با این حرکت، گامی هرچند کوچک
        در راستای تحقق اهداف دولت جمهوری اسلامی ایران برداریم.
      </p>
    </div>
  );
};

export default About;
