import ServiceCard from "./ServiceCard";

import styles from "./ServiceCard.module.css";

const Services = () => {

  const AllData = [
    {
      id: 1,
      title: "نصب",
      description:
        "نصب دوربین مداربسته نیازمند جانمایی دقیق، کابل‌کشی اصولی و تنظیم زاویه دید است تا امنیت محیط به‌طور کامل و بدون نقطه کور تأمین شود.",
    },
    {
      id: 2,
      title: "کانفیگ کردن",
      description:
        "کانفیگ دوربین شامل تنظیمات شبکه، تعریف کاربران، فعال‌سازی هشدارها و بهینه‌سازی کیفیت تصویر است تا عملکرد سیستم دقیق و بی‌نقص باشد.",
    },
    {
      id: 3,
      title: "نگهداری",
      description:
        "نگهداری دوره‌ای شامل بررسی اتصالات، پاک‌سازی لنز، به‌روزرسانی نرم‌افزار و اطمینان از عملکرد صحیح دستگاه‌ها برای افزایش طول عمر سیستم است.",
    },
    {
      id: 4,
      title: "تعمیر و خدمات",
      description:
        "در صورت خرابی، تعمیر تخصصی دوربین، DVR یا NVR ضروری است. خدمات سریع و دقیق، عملکرد دوباره سیستم امنیتی را تضمین می‌کند.",
    },
    {
      id: 5,
      title: "مانیتورینگ",
      description:
        "در مانیتورینگ، تصاویر دوربین‌ها به‌صورت زنده بررسی می‌شوند تا در صورت وقوع حادثه، اقدامات لازم فوری انجام شده و نظارت دائمی برقرار بماند.",
    },
    {
      id: 6,
      title: "اکسس کنترل",
      description:
        "سیستم اکسس کنترل، با کنترل ورود و خروج افراد از طریق کارت، رمز یا اثر انگشت، امنیت دسترسی به بخش‌های حساس را افزایش می‌دهد.",
    },
  ];
  return (
    <div className={styles.container}>
      <h2>خدمات</h2>
      <div className={styles.serviceBox}>
        {AllData.map((data) => (
          <ServiceCard data={data} key={data.id} />
        ))}
      </div>

    </div>
  );
};
export default Services;
